<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FacultiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $faculties = array('016 Спеціальна освіта',
            '017 Фізична культура і спорт',
            '022 Дизайн',
            '035.04 Філологія (германські мови та літератури (переклад включно))',
            '051 Економіка',
            '052 Політологія',
            '053 Психологія',
            '054 Соціологія',
            '061 Журналістика',
            '071 Облік і оподаткування',
            '072 Фінанси, банківська справа та страхування',
            '073 Менеджмент',
            '073 Менеджмент',
            '075 Маркетинг',
            '076 Підприємництво, торгівля та біржова діяльність',
            '076 Підприємництво, торгівля та біржова діяльність',
            '081 Право',
            '121 Інженерія програмного забезпечення',
            '122 Комп’ютерні науки',
            '123 Комп’ютерна інженерія',
            '124 Системний аналіз',
            '125 Кібербезпека',
            '131 Прикладна механіка',
            '131 Прикладна механіка',
            '132 Матеріалознавство',
            '132 Матеріалознавство',
            '133 Галузеве машинобудування',
            '133 Галузеве машинобудування',
            '134 Авіаційна та ракетно-космічна техніка',
            '136 Металургія',
            '141 Електроенергетика, електротехніка та електромеханіка',
            '144 Теплоенергетика',
            '151 Автоматизація та комп’ютерно-інтегровані технології',
            '151 Автоматизація та комп’ютерно-інтегровані технології',
            '152 Метрологія та інформаційно-вимірювальна техніка',
            '153 Мікро- та наносистемна техніка',
            '172 Телекомунікації та радіотехніка',
            '173 Авіоніка',
            '191 Архітектура та містобудування',
            '192 Будівництво та цивільна інженерія',
            '227 Фізична терапія, ерготерапія',
            '231 Соціальна робота',
            '241 Готельно-ресторанна справа',
            '242 Туризм',
            '262 Правоохоронна діяльність',
            '275.02 Транспортні технології (на залізничному транспорті)',
            '275.03 Транспортні технології (на автомобільному транспорті)',
            '281 Публічне управління та адміністрування',
            '292 Міжнародні економічні відносини'
        );

        for ($i = 0; $i < count($faculties); $i++) {
            DB::table('faculties')->insert(['name' => $faculties[$i]]);

        }
    }
}
